#+TITLE: CALLING FUNCTIONS
#+AUTHOR: Marcus Birkenkrahe
#+SUBTITLE: DSC 205 - Advanced introduction to data science
#+STARTUP: overview hideblocks indent
#+OPTIONS: toc:nil num:nil ^:nil
#+PROPERTY: header-args:R :session *R* :results output :exports both :noweb yes
* Global environments

- Every object you've created or overwritten resides in the global
  environment of your R session.

- A call to ~ls()~ lists all objects, variables, and user-defined
  functions in the global environment

- Example: create three new objects and confirm their existence in the
  global environment:
  #+begin_src R
    foo <- 4 + 5
    bar <- "stringtastic"
    hello <- function() print("hello")
    ls()
    hello()
  #+end_src

  #+RESULTS:
  : [1] "bar"   "foo"   "hello"
  : [1] "hello"
  
